Revit 2026 API

# StructuralConnectionHandlerRemoveElementIds Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveElementIds(
	IList<ElementId> elemIds
)
```
```vb
Public Sub RemoveElementIds (
	elemIds As IList(Of ElementId)
)
```
```cpp
public:
void RemoveElementIds(
	IList<ElementId^>^ elemIds
)
```
```fsharp
member RemoveElementIds :
        elemIds : IList<ElementId> -> unit
```

#### Parameters

elemIds IListElementId

#### Reference

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace